srds-results/macrobench/single_node/dropbox/confd_sign/cauchy_rsa_sha_512/stdout-1.txt
File //random1.dat could not be found
Creating data file...done
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.2.23 (be patient)...INFO: PUT header == 
---
PUT / HTTP/1.0
Content-length: 1048576
Content-type: text/plain
Host: 172.16.2.23:3000
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:54:14 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

7fe20052-8fac-4d47-97c8-f4da9481c28b
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:54:14 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

17bb8cbf-c72d-4a5e-b88c-19df7afd0128
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:54:18 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

80f82039-e6eb-459b-a0f4-f7cebbd3045d
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:54:20 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

17573dd9-fb9c-4160-a764-7402af0f6237
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:54:30 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

3c6a5c45-c868-4ed7-bfee-7e6e1da120b2
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:54:30 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

a94e4ae0-5908-4f45-8937-b8e6f51e42c0
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:54:34 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

240293fa-2f29-4787-bd09-09b3d1eb292d
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:54:35 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

098dcbf5-362f-4f1a-a87b-41df55d94703
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:54:47 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

90944bf1-0ea4-42b8-b79b-b07f40798d4a
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:54:47 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

4d1c40e3-7969-4a4d-a74b-32232c327ebb
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:54:49 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

21ded734-1246-4957-b083-efd510ad61f4
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:54:50 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

a523de29-1e3f-449a-b967-fc699102538d
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:02 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

68573f9e-3215-4845-9e7f-68c5ec817b2d
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:03 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

4332d939-b2fe-485b-9f73-3c53ed90d7e5
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:05 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

19f45857-a462-4d08-a491-768864db9e6b
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:07 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

07504c4a-5a74-44f0-9ee7-2e6ce8e28c62
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:18 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

4948f00a-a7fc-4974-bde9-7b5a3b7150c3
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:18 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

fdd02392-89e1-4af2-908f-af73463e029c
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:21 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

f19a2167-92be-4966-9b0e-c94ddc37174b
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:23 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

8411b311-0889-4f45-9bd8-69b462238833
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:33 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

584e2cdf-23f5-418b-9b0b-ce9be6c842de
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:34 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

27286778-2fa9-4f31-a54d-51b8e4148a84
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:37 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

d4be0f99-9488-4f43-9556-d2cf1a6a4f4d
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:40 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

b70139ae-f0ab-46d9-99d5-b61aa696dc3b
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:50 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

8440caf8-f59d-44df-b9ac-b6d3a8217de9
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:51 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

beb48d6b-627d-488b-b281-68398f6523a2
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:53 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

8a37e533-798f-424f-b94a-0505f56aa195
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:55:57 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

7d64bf40-9010-442e-b620-51c85f58275b
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:05 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

e0203506-c967-4a47-97e3-0ae3e5422008
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:08 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

7d6d4746-f045-49ee-91db-60cc69ec9a25
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:08 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

bf000f73-2d4d-4c4b-b20f-be982c5a1fc2
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:10 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

d524f4f6-48e1-4b2b-97ff-827c640573ff
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:21 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

e5a2db53-f0df-499a-b3ad-922a4d7d4c25
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:24 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

bfae5d5c-81fe-4d2c-a8bf-821275492eae
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:24 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

ae02cb91-b9d7-4932-b6bd-3538c0512a1b
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:25 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

64f07661-8cfd-4859-a151-18fd62ac72a5
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:33 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

b01df8df-22cd-4284-8384-bbb1f520f794
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:40 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

c61385d0-0ea2-4f32-9c39-0746c0e7fafd
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:41 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

4a1d96cc-fbfc-4bbd-9056-01909980eabf
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:42 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

1b05063e-2be1-41aa-bc3c-95228985b4fc
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:50 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

cb31f121-53ab-4443-9baa-03906f43f413
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:55 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

c5cf50d0-5c5f-433c-a658-7947f9d42384
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:56 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

b58e898e-beb1-433b-ae97-dfd3d017492e
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:58 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

ccf29feb-b7b3-4031-92bb-740bfee06af8
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:56:58 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

8af46f96-3f26-464d-a8ad-b730cc474eac
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:57:11 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

f5bdd07f-a622-469a-a306-5fe47e4343d4
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:57:13 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

7e03cb78-9246-4403-96c3-7cb6510395af
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:57:14 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

d9fa87ef-0af4-478a-b610-8476b6511809
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:57:14 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

4e48fbb8-450e-40a7-9de3-7109bb91194d
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK

LOG: header received:
HTTP/1.0 200 OK
Server: PasteWSGIServer/0.5 Python/2.7.10
Date: Wed, 20 Apr 2016 01:57:26 GMT
Content-Length: 36
Content-Type: text/html; charset=UTF-8

bdf624a1-062a-47fa-8c87-8b393a4358c9
LOG: Response code = 200
..done


Server Software:        PasteWSGIServer/0.5
Server Hostname:        172.16.2.23
Server Port:            3000

Document Path:          /
Document Length:        36 bytes

Concurrency Level:      4
Time taken for tests:   205.861 seconds
Complete requests:      50
Failed requests:        0
Total transferred:      9750 bytes
Total body sent:        52435550
HTML transferred:       1800 bytes
Requests per second:    0.24 [#/sec] (mean)
Time per request:       16468.870 [ms] (mean)
Time per request:       4117.218 [ms] (mean, across all concurrent requests)
Transfer rate:          0.05 [Kbytes/sec] received
                        248.74 kb/s sent
                        248.79 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   9.9      0      63
Processing:  5045 15752 2316.8  16194   20147
Waiting:     5038 15743 2316.1  16187   20120
Total:       5045 15755 2317.9  16195   20148

Percentage of the requests served within a certain time (ms)
  50%  16195
  66%  16513
  75%  16732
  80%  16989
  90%  17459
  95%  18090
  98%  20148
  99%  20148
 100%  20148 (longest request)